Tekla.Structures.ModelInternal.RebarThreading
The rebar threading class.

Tekla.Structures.ModelInternal.RebarThreading.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.RebarThreading class.

Tekla.Structures.ModelInternal.RebarThreading.ToStruct(Tekla.Structures.ModelInternal.dotRebarThreading_t@)
The to struct method.
dotThread: The dot rebar threading struct.

Tekla.Structures.ModelInternal.RebarThreading.FromStruct(Tekla.Structures.ModelInternal.dotRebarThreading_t@)
The from struct method.
dotThread: The dot rebar threading struct.

Tekla.Structures.ModelInternal.RebarThreading.ThreadingType
Gets or sets the threading type.

Tekla.Structures.ModelInternal.RebarThreading.Length
Gets or sets the length.

Tekla.Structures.ModelInternal.RebarThreading.ExtraFabLength
Gets or sets the extra fab length.